<?php

namespace Database\Seeders;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;


class WordsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $firstarabicWords = [
            1 => 'أسد', 2 => 'باب', 3 => 'تاج', 4 => 'ثلج', 5 => 'جبل',
            6 => 'حصان', 7 => 'خبز', 8 => 'دراجة', 9 => 'ذهب', 10 => 'رمل',
            11 => 'زهرة', 12 => 'سيارة', 13 => 'شاحنة', 14 => 'صبار',
            15 => 'ضبع', 16 => 'طائر', 17 => 'ظفر', 18 => 'عين', 19 => 'غيمة',
            20 => 'فأر', 21 => 'قرد', 22 => 'كلب', 23 => 'ليمون', 24 => 'ماء',
            25 => 'نهر', 26 => 'هر', 27 => 'ولد', 28 => 'يد'
        ];
        $secondabicWords = [
            29 => 'نافذة', 30 =>'حبر', 31 =>'زيتون' ,32 =>'ثاء' , 33 => 'حجر',
            34 => 'أحمر', 35 =>'أخضر', 36 =>'قدم' ,37 => 'أذن', 38 =>'أرجوحة' ,
            40 => 'مزمار', 41 =>'مسمار', 42 => 'منشار' ,43 => 'مصباح',
            44 => "ضاد", 45 =>'مطر', 46 =>'مظلة' ,47 => 'معمل', 48 => 'لغم',
            49 => 'مفك', 50 =>"مقص", 51 =>"مكتب" ,52 => "ملعب", 53 => "دمع",
            54 => 'أنف', 55 =>'مهد', 56 =>'واو' ,57 => 'ياء',
        ]; 
        $lastabicWords = [
            58 => '',59 =>'', 60 =>'' ,61 =>'' , 62 => '',
            63 => '', 64 =>'', 65 =>'' ,66 =>'', 67 =>'' ,
            68 => '', 69 =>'', 70 => '' ,71 =>'',
            72 => '', 73 =>'', 74 =>'' ,75=>'', 76 => '',
            77 => '', 78 =>'', 79 =>'' ,80 =>'', 81=> '',
            82 => '', 83 =>'', 84 =>'' ,85 => '',
        ];
        

        foreach ($firstarabicWords  as $characterId => $word) {
            DB::table('words')->insert([
                'word' => $word,
                'character_id' => $characterId,
            ]);
        } 
    }
}
